# RbsElecDemandfactorLoadclassificationParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecDemandfactorLoadclassificationParam Property
ParameterTypeId Class See Also
---
"Load Classification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecDemandfactorLoadclassificationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecDemandfactorLoadclassificationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecDemandfactorLoadclassificationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace